app/controllers/articles_controller.rb

  def edit
    @article = Article.find_by(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE (1) LIMIT ?  [["LIMIT", 1]]